/*
// 1:Создать пустой массив и в него добавить числа от 0 до 10 при помощи цикла for (используйте метод push() )

var arr = []
for(i=0;i<=10;i++){
    arr.push(i)
    console.log(i)
}
*/

/*
// 2:При помощи цикла выводить цифры в убывающем порядке от 20 до 0

for(var i=20 ;i>=0;i--) {
    console.log(i)
    }
*/

/*
// 3:Светофор 
var color = prompt('Введите цвет')
if (color==='зеленый'){
    alert('Можете идти')
}else if (color === 'красный'){
    alert('Остановитесь!')
}else if (color === 'желтый'){
    alert ('Приготовьтесь')
}
*/